function openUrlInExternal(url) {
	window.open(url, "_system");
	return false;
}

function openAppUrl(url) {
	window.location.href = url;
}

function getPlenaryTestingData(id) {
	var ret = {};
	ret.id = id;
	ret.type = 1;
	ret.status = 1;
	ret.startDate = '2014-04-09';
	ret.endDate = '2014-04-14';
	ret.link = 'http://www.parliament.bg/bg/plenaryprogram/ID/799';
	ret.pubDate = '2014-04-21 22:49:54';
	ret.agenda = [
		{id: 1, 
			itemText: 'Ново обсъждане на Закона за изменение и допълнение на Закона за собствеността и ползуването на земеделските земи, приет от Народното събрание на 4 април 2014 г. и върнат за ново обсъждане с Указ № 73 от 11 април 2014 г. на Президента на Републиката по чл. 101 от Конституцията на Република България.',
			isBill: '1',
			billLink: 'http://www.parliament.bg/bg/bills/ID/14832/'},
		{id: 2, 
			itemText: 'Второ гласуване на Законопроект за изменение и допълнение на Закона за устройството на Черноморското крайбрежие (Общ законопроект, изготвен на основата на приетите на първо гласуване на 7.2.2014 г. два законопроекта с вносители: Снежина Маджарова и група народни представители, 30.10.2013 г.; Димчо Михалевски и група народни представители, 27.11.2013 г.) - продължение.',
			isBill: '1',
			billLink: 'http://www.parliament.bg/bg/bills/ID/14800/'},
		{id: 3, 
			itemText: 'Второ гласуване на Законопроект за изменение и допълнение на Закона за обществените поръчки (Вносител: Министерски съвет, 29.8.2013 г. Приет на първо гласуване на 10.10.2013 г.) - продължение.',
			isBill: '0',
			billLink: ''},
		{id: 4, 
			itemText: 'Второ гласуване на Законопроект за изменение и допълнение на Закона за устройството на Черноморското крайбрежие (Общ законопроект, изготвен на основата на приетите на първо гласуване на 7.2.2014 г. два законопроекта с вносители: Снежина Маджарова и група народни представители, 30.10.2013 г.; Димчо Михалевски и група народни представители, 27.11.2013 г.) - продължение.',
			isBill: '1',
			billLink: 'http://www.parliament.bg/bg/bills/ID/14800/'},
		{id: 5, 
			itemText: 'Второ гласуване на Законопроект за изменение и допълнение на Закона за устройството на Черноморското крайбрежие (Общ законопроект, изготвен на основата на приетите на първо гласуване на 7.2.2014 г. два законопроекта с вносители: Снежина Маджарова и група народни представители, 30.10.2013 г.; Димчо Михалевски и група народни представители, 27.11.2013 г.) - продължение.',
			isBill: '1',
			billLink: 'http://www.parliament.bg/bg/bills/ID/14800/'},
	];
	
	return ret;
}